GopalSaraf/Practicals/PSDL/include/proc/pic12f752.inc
// Register: OSCTUNE
#define OSCTUNE OSCTUNE
OSCTUNE                                  equ 0189h
// bitfield definitions
OSCTUNE_TUN_POSN                         equ 0000h
OSCTUNE_TUN_POSITION                     equ 0000h
OSCTUNE_TUN_SIZE                         equ 0005h
OSCTUNE_TUN_LENGTH                       equ 0005h
OSCTUNE_TUN_MASK                         equ 001Fh
OSCTUNE_TUN0_POSN                        equ 0000h
OSCTUNE_TUN0_POSITION                    equ 0000h
OSCTUNE_TUN0_SIZE                        equ 0001h
OSCTUNE_TUN0_LENGTH                      equ 0001h
OSCTUNE_TUN0_MASK                        equ 0001h
OSCTUNE_TUN1_POSN                        equ 0001h
OSCTUNE_TUN1_POSITION                    equ 0001h
OSCTUNE_TUN1_SIZE                        equ 0001h
OSCTUNE_TUN1_LENGTH                      equ 0001h
OSCTUNE_TUN1_MASK                        equ 0002h
OSCTUNE_TUN2_POSN                        equ 0002h
OSCTUNE_TUN2_POSITION                    equ 0002h
OSCTUNE_TUN2_SIZE                        equ 0001h
OSCTUNE_TUN2_LENGTH                      equ 0001h
OSCTUNE_TUN2_MASK                        equ 0004h
OSCTUNE_TUN3_POSN                        equ 0003h
OSCTUNE_TUN3_POSITION                    equ 0003h
OSCTUNE_TUN3_SIZE                        equ 0001h
OSCTUNE_TUN3_LENGTH                      equ 0001h
OSCTUNE_TUN3_MASK                        equ 0008h
OSCTUNE_TUN4_POSN                        equ 0004h
OSCTUNE_TUN4_POSITION                    equ 0004h
OSCTUNE_TUN4_SIZE                        equ 0001h
OSCTUNE_TUN4_LENGTH                      equ 0001h
OSCTUNE_TUN4_MASK                        equ 0010h

// Register: PMCON1
#define PMCON1 PMCON1
PMCON1                                   equ 018Ch
// bitfield definitions
PMCON1_RD_POSN                           equ 0000h
PMCON1_RD_POSITION                       equ 0000h
PMCON1_RD_SIZE                           equ 0001h
PMCON1_RD_LENGTH                         equ 0001h
PMCON1_RD_MASK                           equ 0001h
PMCON1_WR_POSN                           equ 0001h
PMCON1_WR_POSITION                       equ 0001h
PMCON1_WR_SIZE                           equ 0001h
PMCON1_WR_LENGTH                         equ 0001h
PMCON1_WR_MASK                           equ 0002h
PMCON1_WREN_POSN                         equ 0002h
PMCON1_WREN_POSITION                     equ 0002h
PMCON1_WREN_SIZE                         equ 0001h
PMCON1_WREN_LENGTH                       equ 0001h
PMCON1_WREN_MASK                         equ 0004h

// Register: PMCON2
#define PMCON2 PMCON2
PMCON2                                   equ 018Dh
// bitfield definitions
PMCON2_PMCON2_POSN                       equ 0000h
PMCON2_PMCON2_POSITION                   equ 0000h
PMCON2_PMCON2_SIZE                       equ 0008h
PMCON2_PMCON2_LENGTH                     equ 0008h
PMCON2_PMCON2_MASK                       equ 00FFh

// Register: PMADRL
#define PMADRL PMADRL
PMADRL                                   equ 018Eh
// bitfield definitions
PMADRL_PMADRL_POSN                       equ 0000h
PMADRL_PMADRL_POSITION                   equ 0000h
PMADRL_PMADRL_SIZE                       equ 0008h
PMADRL_PMADRL_LENGTH                     equ 0008h
PMADRL_PMADRL_MASK                       equ 00FFh

// Register: PMADRH
#define PMADRH PMADRH
PMADRH                                   equ 018Fh
// bitfield definitions
PMADRH_PMADRH_POSN                       equ 0000h
PMADRH_PMADRH_POSITION                   equ 0000h
PMADRH_PMADRH_SIZE                       equ 0002h
PMADRH_PMADRH_LENGTH                     equ 0002h
PMADRH_PMADRH_MASK                       equ 0003h

// Register: PMDATL
#define PMDATL PMDATL
PMDATL                                   equ 0190h
// bitfield definitions
PMDATL_PMDATL_POSN                       equ 0000h
PMDATL_PMDATL_POSITION                   equ 0000h
PMDATL_PMDATL_SIZE                       equ 0008h
PMDATL_PMDATL_LENGTH                     equ 0008h
PMDATL_PMDATL_MASK                       equ 00FFh

// Register: PMDATH
#define PMDATH PMDATH
PMDATH                                   equ 0191h
// bitfield definitions
PMDATH_PMDATH_POSN                       equ 0000h
PMDATH_PMDATH_POSITION                   equ 0000h
PMDATH_PMDATH_SIZE                       equ 0006h
PMDATH_PMDATH_LENGTH                     equ 0006h
PMDATH_PMDATH_MASK                       equ 003Fh

// Register: COG1PH
#define COG1PH COG1PH
COG1PH                                   equ 0192h
// bitfield definitions
COG1PH_G1PH_POSN                         equ 0000h
COG1PH_G1PH_POSITION                     equ 0000h
COG1PH_G1PH_SIZE                         equ 0004h
COG1PH_G1PH_LENGTH                       equ 0004h
COG1PH_G1PH_MASK                         equ 000Fh
COG1PH_G1PH0_POSN                        equ 0000h
COG1PH_G1PH0_POSITION                    equ 0000h
COG1PH_G1PH0_SIZE                        equ 0001h
COG1PH_G1PH0_LENGTH                      equ 0001h
COG1PH_G1PH0_MASK                        equ 0001h
COG1PH_G1PH1_POSN                        equ 0001h
COG1PH_G1PH1_POSITION                    equ 0001h
COG1PH_G1PH1_SIZE                        equ 0001h
COG1PH_G1PH1_LENGTH                      equ 0001h
COG1PH_G1PH1_MASK                        equ 0002h
COG1PH_G1PH2_POSN                        equ 0002h
COG1PH_G1PH2_POSITION                    equ 0002h
COG1PH_G1PH2_SIZE                        equ 0001h
COG1PH_G1PH2_LENGTH                      equ 0001h
COG1PH_G1PH2_MASK                        equ 0004h
COG1PH_G1PH3_POSN                        equ 0003h
COG1PH_G1PH3_POSITION                    equ 0003h
COG1PH_G1PH3_SIZE                        equ 0001h
COG1PH_G1PH3_LENGTH                      equ 0001h
COG1PH_G1PH3_MASK                        equ 0008h

// Register: COG1BLK
#define COG1BLK COG1BLK
COG1BLK                                  equ 0193h
// bitfield definitions
COG1BLK_G1BLKF_POSN                      equ 0000h
COG1BLK_G1BLKF_POSITION                  equ 0000h
COG1BLK_G1BLKF_SIZE                      equ 0004h
COG1BLK_G1BLKF_LENGTH                    equ 0004h
COG1BLK_G1BLKF_MASK                      equ 000Fh
COG1BLK_G1BLKR_POSN                      equ 0004h
COG1BLK_G1BLKR_POSITION                  equ 0004h
COG1BLK_G1BLKR_SIZE                      equ 0004h
COG1BLK_G1BLKR_LENGTH                    equ 0004h
COG1BLK_G1BLKR_MASK                      equ 00F0h
COG1BLK_G1BLKF0_POSN                     equ 0000h
COG1BLK_G1BLKF0_POSITION                 equ 0000h
COG1BLK_G1BLKF0_SIZE                     equ 0001h
COG1BLK_G1BLKF0_LENGTH                   equ 0001h
COG1BLK_G1BLKF0_MASK                     equ 0001h
COG1BLK_G1BLKF1_POSN                     equ 0001h
COG1BLK_G1BLKF1_POSITION                 equ 0001h
COG1BLK_G1BLKF1_SIZE                     equ 0001h
COG1BLK_G1BLKF1_LENGTH                   equ 0001h
COG1BLK_G1BLKF1_MASK                     equ 0002h
COG1BLK_G1BLKF2_POSN                     equ 0002h
COG1BLK_G1BLKF2_POSITION                 equ 0002h
COG1BLK_G1BLKF2_SIZE                     equ 0001h
COG1BLK_G1BLKF2_LENGTH                   equ 0001h
COG1BLK_G1BLKF2_MASK                     equ 0004h
COG1BLK_G1BLKF3_POSN                     equ 0003h
COG1BLK_G1BLKF3_POSITION                 equ 0003h
COG1BLK_G1BLKF3_SIZE                     equ 0001h
COG1BLK_G1BLKF3_LENGTH                   equ 0001h
COG1BLK_G1BLKF3_MASK                     equ 0008h
COG1BLK_G1BLKR0_POSN                     equ 0004h
COG1BLK_G1BLKR0_POSITION                 equ 0004h
COG1BLK_G1BLKR0_SIZE                     equ 0001h
COG1BLK_G1BLKR0_LENGTH                   equ 0001h
COG1BLK_G1BLKR0_MASK                     equ 0010h
COG1BLK_G1BLKR1_POSN                     equ 0005h
COG1BLK_G1BLKR1_POSITION                 equ 0005h
COG1BLK_G1BLKR1_SIZE                     equ 0001h
COG1BLK_G1BLKR1_LENGTH                   equ 0001h
COG1BLK_G1BLKR1_MASK                     equ 0020h
COG1BLK_G1BLKR2_POSN                     equ 0006h
COG1BLK_G1BLKR2_POSITION                 equ 0006h
COG1BLK_G1BLKR2_SIZE                     equ 0001h
COG1BLK_G1BLKR2_LENGTH                   equ 0001h
COG1BLK_G1BLKR2_MASK                     equ 0040h
COG1BLK_G1BLKR3_POSN                     equ 0007h
COG1BLK_G1BLKR3_POSITION                 equ 0007h
COG1BLK_G1BLKR3_SIZE                     equ 0001h
COG1BLK_G1BLKR3_LENGTH                   equ 0001h
COG1BLK_G1BLKR3_MASK                     equ 0080h

