GopalSaraf/Practicals/PSDL/include/proc/pic12f752.inc
// Register: COG1DB
#define COG1DB COG1DB
COG1DB                                   equ 0194h
// bitfield definitions
COG1DB_G1DBF_POSN                        equ 0000h
COG1DB_G1DBF_POSITION                    equ 0000h
COG1DB_G1DBF_SIZE                        equ 0004h
COG1DB_G1DBF_LENGTH                      equ 0004h
COG1DB_G1DBF_MASK                        equ 000Fh
COG1DB_G1DBR_POSN                        equ 0004h
COG1DB_G1DBR_POSITION                    equ 0004h
COG1DB_G1DBR_SIZE                        equ 0004h
COG1DB_G1DBR_LENGTH                      equ 0004h
COG1DB_G1DBR_MASK                        equ 00F0h
COG1DB_G1DBF0_POSN                       equ 0000h
COG1DB_G1DBF0_POSITION                   equ 0000h
COG1DB_G1DBF0_SIZE                       equ 0001h
COG1DB_G1DBF0_LENGTH                     equ 0001h
COG1DB_G1DBF0_MASK                       equ 0001h
COG1DB_G1DBF1_POSN                       equ 0001h
COG1DB_G1DBF1_POSITION                   equ 0001h
COG1DB_G1DBF1_SIZE                       equ 0001h
COG1DB_G1DBF1_LENGTH                     equ 0001h
COG1DB_G1DBF1_MASK                       equ 0002h
COG1DB_G1DBF2_POSN                       equ 0002h
COG1DB_G1DBF2_POSITION                   equ 0002h
COG1DB_G1DBF2_SIZE                       equ 0001h
COG1DB_G1DBF2_LENGTH                     equ 0001h
COG1DB_G1DBF2_MASK                       equ 0004h
COG1DB_G1DBF3_POSN                       equ 0003h
COG1DB_G1DBF3_POSITION                   equ 0003h
COG1DB_G1DBF3_SIZE                       equ 0001h
COG1DB_G1DBF3_LENGTH                     equ 0001h
COG1DB_G1DBF3_MASK                       equ 0008h
COG1DB_G1BDR0_POSN                       equ 0004h
COG1DB_G1BDR0_POSITION                   equ 0004h
COG1DB_G1BDR0_SIZE                       equ 0001h
COG1DB_G1BDR0_LENGTH                     equ 0001h
COG1DB_G1BDR0_MASK                       equ 0010h
COG1DB_G1BDR1_POSN                       equ 0005h
COG1DB_G1BDR1_POSITION                   equ 0005h
COG1DB_G1BDR1_SIZE                       equ 0001h
COG1DB_G1BDR1_LENGTH                     equ 0001h
COG1DB_G1BDR1_MASK                       equ 0020h
COG1DB_G1BDR2_POSN                       equ 0006h
COG1DB_G1BDR2_POSITION                   equ 0006h
COG1DB_G1BDR2_SIZE                       equ 0001h
COG1DB_G1BDR2_LENGTH                     equ 0001h
COG1DB_G1BDR2_MASK                       equ 0040h
COG1DB_G1BDR3_POSN                       equ 0007h
COG1DB_G1BDR3_POSITION                   equ 0007h
COG1DB_G1BDR3_SIZE                       equ 0001h
COG1DB_G1BDR3_LENGTH                     equ 0001h
COG1DB_G1BDR3_MASK                       equ 0080h

// Register: COG1CON0
#define COG1CON0 COG1CON0
COG1CON0                                 equ 0195h
// bitfield definitions
COG1CON0_G1CS_POSN                       equ 0000h
COG1CON0_G1CS_POSITION                   equ 0000h
COG1CON0_G1CS_SIZE                       equ 0002h
COG1CON0_G1CS_LENGTH                     equ 0002h
COG1CON0_G1CS_MASK                       equ 0003h
COG1CON0_G1LD_POSN                       equ 0002h
COG1CON0_G1LD_POSITION                   equ 0002h
COG1CON0_G1LD_SIZE                       equ 0001h
COG1CON0_G1LD_LENGTH                     equ 0001h
COG1CON0_G1LD_MASK                       equ 0004h
COG1CON0_G1POL0_POSN                     equ 0003h
COG1CON0_G1POL0_POSITION                 equ 0003h
COG1CON0_G1POL0_SIZE                     equ 0001h
COG1CON0_G1POL0_LENGTH                   equ 0001h
COG1CON0_G1POL0_MASK                     equ 0008h
COG1CON0_G1POL1_POSN                     equ 0004h
COG1CON0_G1POL1_POSITION                 equ 0004h
COG1CON0_G1POL1_SIZE                     equ 0001h
COG1CON0_G1POL1_LENGTH                   equ 0001h
COG1CON0_G1POL1_MASK                     equ 0010h
COG1CON0_G1OE0_POSN                      equ 0005h
COG1CON0_G1OE0_POSITION                  equ 0005h
COG1CON0_G1OE0_SIZE                      equ 0001h
COG1CON0_G1OE0_LENGTH                    equ 0001h
COG1CON0_G1OE0_MASK                      equ 0020h
COG1CON0_G1OE1_POSN                      equ 0006h
COG1CON0_G1OE1_POSITION                  equ 0006h
COG1CON0_G1OE1_SIZE                      equ 0001h
COG1CON0_G1OE1_LENGTH                    equ 0001h
COG1CON0_G1OE1_MASK                      equ 0040h
COG1CON0_G1EN_POSN                       equ 0007h
COG1CON0_G1EN_POSITION                   equ 0007h
COG1CON0_G1EN_SIZE                       equ 0001h
COG1CON0_G1EN_LENGTH                     equ 0001h
COG1CON0_G1EN_MASK                       equ 0080h
COG1CON0_G1CS0_POSN                      equ 0000h
COG1CON0_G1CS0_POSITION                  equ 0000h
COG1CON0_G1CS0_SIZE                      equ 0001h
COG1CON0_G1CS0_LENGTH                    equ 0001h
COG1CON0_G1CS0_MASK                      equ 0001h
COG1CON0_G1CS1_POSN                      equ 0001h
COG1CON0_G1CS1_POSITION                  equ 0001h
COG1CON0_G1CS1_SIZE                      equ 0001h
COG1CON0_G1CS1_LENGTH                    equ 0001h
COG1CON0_G1CS1_MASK                      equ 0002h

// Register: COG1CON1
#define COG1CON1 COG1CON1
COG1CON1                                 equ 0196h
// bitfield definitions
COG1CON1_G1RS_POSN                       equ 0000h
COG1CON1_G1RS_POSITION                   equ 0000h
COG1CON1_G1RS_SIZE                       equ 0003h
COG1CON1_G1RS_LENGTH                     equ 0003h
COG1CON1_G1RS_MASK                       equ 0007h
COG1CON1_G1FS_POSN                       equ 0003h
COG1CON1_G1FS_POSITION                   equ 0003h
COG1CON1_G1FS_SIZE                       equ 0003h
COG1CON1_G1FS_LENGTH                     equ 0003h
COG1CON1_G1FS_MASK                       equ 0038h
COG1CON1_G1RSIM_POSN                     equ 0006h
COG1CON1_G1RSIM_POSITION                 equ 0006h
COG1CON1_G1RSIM_SIZE                     equ 0001h
COG1CON1_G1RSIM_LENGTH                   equ 0001h
COG1CON1_G1RSIM_MASK                     equ 0040h
COG1CON1_G1FSIM_POSN                     equ 0007h
COG1CON1_G1FSIM_POSITION                 equ 0007h
COG1CON1_G1FSIM_SIZE                     equ 0001h
COG1CON1_G1FSIM_LENGTH                   equ 0001h
COG1CON1_G1FSIM_MASK                     equ 0080h
COG1CON1_G1RS0_POSN                      equ 0000h
COG1CON1_G1RS0_POSITION                  equ 0000h
COG1CON1_G1RS0_SIZE                      equ 0001h
COG1CON1_G1RS0_LENGTH                    equ 0001h
COG1CON1_G1RS0_MASK                      equ 0001h
COG1CON1_G1RS1_POSN                      equ 0001h
COG1CON1_G1RS1_POSITION                  equ 0001h
COG1CON1_G1RS1_SIZE                      equ 0001h
COG1CON1_G1RS1_LENGTH                    equ 0001h
COG1CON1_G1RS1_MASK                      equ 0002h
COG1CON1_G1RS2_POSN                      equ 0002h
COG1CON1_G1RS2_POSITION                  equ 0002h
COG1CON1_G1RS2_SIZE                      equ 0001h
COG1CON1_G1RS2_LENGTH                    equ 0001h
COG1CON1_G1RS2_MASK                      equ 0004h
COG1CON1_G1FS0_POSN                      equ 0003h
COG1CON1_G1FS0_POSITION                  equ 0003h
COG1CON1_G1FS0_SIZE                      equ 0001h
COG1CON1_G1FS0_LENGTH                    equ 0001h
COG1CON1_G1FS0_MASK                      equ 0008h
COG1CON1_G1FS1_POSN                      equ 0004h
COG1CON1_G1FS1_POSITION                  equ 0004h
COG1CON1_G1FS1_SIZE                      equ 0001h
COG1CON1_G1FS1_LENGTH                    equ 0001h
COG1CON1_G1FS1_MASK                      equ 0010h
COG1CON1_G1FS2_POSN                      equ 0005h
COG1CON1_G1FS2_POSITION                  equ 0005h
COG1CON1_G1FS2_SIZE                      equ 0001h
COG1CON1_G1FS2_LENGTH                    equ 0001h
COG1CON1_G1FS2_MASK                      equ 0020h

// Register: COG1ASD
#define COG1ASD COG1ASD
COG1ASD                                  equ 0197h
// bitfield definitions
COG1ASD_G1ASDSFLT_POSN                   equ 0000h
COG1ASD_G1ASDSFLT_POSITION               equ 0000h
COG1ASD_G1ASDSFLT_SIZE                   equ 0001h
COG1ASD_G1ASDSFLT_LENGTH                 equ 0001h
COG1ASD_G1ASDSFLT_MASK                   equ 0001h
COG1ASD_G1ASDSC1_POSN                    equ 0001h
COG1ASD_G1ASDSC1_POSITION                equ 0001h
COG1ASD_G1ASDSC1_SIZE                    equ 0001h
COG1ASD_G1ASDSC1_LENGTH                  equ 0001h
COG1ASD_G1ASDSC1_MASK                    equ 0002h
COG1ASD_G1ASDSC2_POSN                    equ 0002h
COG1ASD_G1ASDSC2_POSITION                equ 0002h
COG1ASD_G1ASDSC2_SIZE                    equ 0001h
COG1ASD_G1ASDSC2_LENGTH                  equ 0001h
COG1ASD_G1ASDSC2_MASK                    equ 0004h
COG1ASD_G1ASDSHLT_POSN                   equ 0003h
COG1ASD_G1ASDSHLT_POSITION               equ 0003h
COG1ASD_G1ASDSHLT_SIZE                   equ 0001h
COG1ASD_G1ASDSHLT_LENGTH                 equ 0001h
COG1ASD_G1ASDSHLT_MASK                   equ 0008h
COG1ASD_G1ASDL0_POSN                     equ 0004h
COG1ASD_G1ASDL0_POSITION                 equ 0004h
COG1ASD_G1ASDL0_SIZE                     equ 0001h
COG1ASD_G1ASDL0_LENGTH                   equ 0001h
COG1ASD_G1ASDL0_MASK                     equ 0010h
COG1ASD_G1ASDL1_POSN                     equ 0005h
COG1ASD_G1ASDL1_POSITION                 equ 0005h
COG1ASD_G1ASDL1_SIZE                     equ 0001h
COG1ASD_G1ASDL1_LENGTH                   equ 0001h
COG1ASD_G1ASDL1_MASK                     equ 0020h
COG1ASD_G1ARSEN_POSN                     equ 0006h
COG1ASD_G1ARSEN_POSITION                 equ 0006h
COG1ASD_G1ARSEN_SIZE                     equ 0001h
COG1ASD_G1ARSEN_LENGTH                   equ 0001h
COG1ASD_G1ARSEN_MASK                     equ 0040h
COG1ASD_G1ASDE_POSN                      equ 0007h
COG1ASD_G1ASDE_POSITION                  equ 0007h
COG1ASD_G1ASDE_SIZE                      equ 0001h
COG1ASD_G1ASDE_LENGTH                    equ 0001h
COG1ASD_G1ASDE_MASK                      equ 0080h

