GopalSaraf/Practicals/PSDL/include/proc/pic12f752.inc
/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 07FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 07Fh)
#endif
#define ADCS0                            BANKMASK(ADCON1), 4
#define ADCS1                            BANKMASK(ADCON1), 5
#define ADCS2                            BANKMASK(ADCON1), 6
#define ADFM                             BANKMASK(ADCON0), 7
#define ADIE                             BANKMASK(PIE1), 6
#define ADIF                             BANKMASK(PIR1), 6
#define ADON                             BANKMASK(ADCON0), 0
#define ANSA0                            BANKMASK(ANSELA), 0
#define ANSA1                            BANKMASK(ANSELA), 1
#define ANSA2                            BANKMASK(ANSELA), 2
#define ANSA4                            BANKMASK(ANSELA), 4
#define ANSA5                            BANKMASK(ANSELA), 5
#define C1HYS                            BANKMASK(CM1CON0), 1
#define C1IE                             BANKMASK(PIE2), 4
#define C1IF                             BANKMASK(PIR2), 4
#define C1INTN                           BANKMASK(CM1CON1), 6
#define C1INTP                           BANKMASK(CM1CON1), 7
#define C1NCH0                           BANKMASK(CM1CON1), 0
#define C1OE                             BANKMASK(CM1CON0), 5
#define C1ON                             BANKMASK(CM1CON0), 7
#define C1OUT                            BANKMASK(CM1CON0), 6
#define C1PCH0                           BANKMASK(CM1CON1), 4
#define C1PCH1                           BANKMASK(CM1CON1), 5
#define C1POL                            BANKMASK(CM1CON0), 4
#define C1SP                             BANKMASK(CM1CON0), 2
#define C1SYNC                           BANKMASK(CM1CON0), 0
#define C1ZLF                            BANKMASK(CM1CON0), 3
#define C2HYS                            BANKMASK(CM2CON0), 1
#define C2IE                             BANKMASK(PIE2), 5
#define C2IF                             BANKMASK(PIR2), 5
#define C2INTN                           BANKMASK(CM2CON1), 6
#define C2INTP                           BANKMASK(CM2CON1), 7
#define C2NCH0                           BANKMASK(CM2CON1), 0
#define C2OE                             BANKMASK(CM2CON0), 5
#define C2ON                             BANKMASK(CM2CON0), 7
#define C2OUT                            BANKMASK(CM2CON0), 6
#define C2PCH0                           BANKMASK(CM2CON1), 4
#define C2PCH1                           BANKMASK(CM2CON1), 5
#define C2POL                            BANKMASK(CM2CON0), 4
#define C2SP                             BANKMASK(CM2CON0), 2
#define C2SYNC                           BANKMASK(CM2CON0), 0
#define C2ZLF                            BANKMASK(CM2CON0), 3
#define CARRY                            BANKMASK(STATUS), 0
#define CCP1IE                           BANKMASK(PIE2), 0
#define CCP1IF                           BANKMASK(PIR2), 0
#define CCP1M0                           BANKMASK(CCP1CON), 0
#define CCP1M1                           BANKMASK(CCP1CON), 1
#define CCP1M2                           BANKMASK(CCP1CON), 2
#define CCP1M3                           BANKMASK(CCP1CON), 3
#define CHS0                             BANKMASK(ADCON0), 2
#define CHS1                             BANKMASK(ADCON0), 3
#define CHS2                             BANKMASK(ADCON0), 4
#define CHS3                             BANKMASK(ADCON0), 5
#define COG1FSEL                         BANKMASK(APFCON), 2
#define COG1IE                           BANKMASK(PIE2), 2
#define COG1IF                           BANKMASK(PIR2), 2
#define COG1O0SEL                        BANKMASK(APFCON), 0
#define COG1O1SEL                        BANKMASK(APFCON), 1
#define DACEN                            BANKMASK(DACCON0), 7
#define DACOE                            BANKMASK(DACCON0), 5
#define DACPSS0                          BANKMASK(DACCON0), 2
#define DACR0                            BANKMASK(DACCON1), 0
#define DACR1                            BANKMASK(DACCON1), 1
#define DACR2                            BANKMASK(DACCON1), 2
#define DACR3                            BANKMASK(DACCON1), 3
#define DACR4                            BANKMASK(DACCON1), 4
#define DACRNG                           BANKMASK(DACCON0), 6
#define DC                               BANKMASK(STATUS), 1
#define DC1B0                            BANKMASK(CCP1CON), 4
#define DC1B1                            BANKMASK(CCP1CON), 5
#define FVRBUFEN                         BANKMASK(FVRCON), 5
#define FVRBUFSS                         BANKMASK(FVRCON), 4
#define FVREN                            BANKMASK(FVRCON), 7
#define FVRRDY                           BANKMASK(FVRCON), 6
#define G1ARSEN                          BANKMASK(COG1ASD), 6
#define G1ASDE                           BANKMASK(COG1ASD), 7
#define G1ASDL0                          BANKMASK(COG1ASD), 4
#define G1ASDL1                          BANKMASK(COG1ASD), 5
#define G1ASDSC1                         BANKMASK(COG1ASD), 1
#define G1ASDSC2                         BANKMASK(COG1ASD), 2
#define G1ASDSFLT                        BANKMASK(COG1ASD), 0
#define G1ASDSHLT                        BANKMASK(COG1ASD), 3
#define G1BDR0                           BANKMASK(COG1DB), 4
#define G1BDR1                           BANKMASK(COG1DB), 5
#define G1BDR2                           BANKMASK(COG1DB), 6
#define G1BDR3                           BANKMASK(COG1DB), 7
#define G1BLKF0                          BANKMASK(COG1BLK), 0
#define G1BLKF1                          BANKMASK(COG1BLK), 1
#define G1BLKF2                          BANKMASK(COG1BLK), 2
#define G1BLKF3                          BANKMASK(COG1BLK), 3
#define G1BLKR0                          BANKMASK(COG1BLK), 4
#define G1BLKR1                          BANKMASK(COG1BLK), 5
#define G1BLKR2                          BANKMASK(COG1BLK), 6
#define G1BLKR3                          BANKMASK(COG1BLK), 7
#define G1CS0                            BANKMASK(COG1CON0), 0
#define G1CS1                            BANKMASK(COG1CON0), 1
#define G1DBF0                           BANKMASK(COG1DB), 0
#define G1DBF1                           BANKMASK(COG1DB), 1
#define G1DBF2                           BANKMASK(COG1DB), 2
#define G1DBF3                           BANKMASK(COG1DB), 3
#define G1EN                             BANKMASK(COG1CON0), 7
#define G1FS0                            BANKMASK(COG1CON1), 3
#define G1FS1                            BANKMASK(COG1CON1), 4
#define G1FS2                            BANKMASK(COG1CON1), 5
#define G1FSIM                           BANKMASK(COG1CON1), 7
#define G1LD                             BANKMASK(COG1CON0), 2
#define G1OE0                            BANKMASK(COG1CON0), 5
#define G1OE1                            BANKMASK(COG1CON0), 6
#define G1PH0                            BANKMASK(COG1PH), 0
#define G1PH1                            BANKMASK(COG1PH), 1
#define G1PH2                            BANKMASK(COG1PH), 2
#define G1PH3                            BANKMASK(COG1PH), 3
#define G1POL0                           BANKMASK(COG1CON0), 3
#define G1POL1                           BANKMASK(COG1CON0), 4
#define G1RS0                            BANKMASK(COG1CON1), 0
#define G1RS1                            BANKMASK(COG1CON1), 1
#define G1RS2                            BANKMASK(COG1CON1), 2
#define G1RSIM                           BANKMASK(COG1CON1), 6
#define GIE                              BANKMASK(INTCON), 7
#define GO_nDONE                         BANKMASK(ADCON0), 1
#define H1CKPS0                          BANKMASK(HLT1CON0), 0
#define H1CKPS1                          BANKMASK(HLT1CON0), 1
#define H1ERS0                           BANKMASK(HLT1CON1), 2
#define H1ERS1                           BANKMASK(HLT1CON1), 3
#define H1ERS2                           BANKMASK(HLT1CON1), 4
#define H1FEREN                          BANKMASK(HLT1CON1), 1
#define H1ON                             BANKMASK(HLT1CON0), 2
#define H1OUTPS0                         BANKMASK(HLT1CON0), 3
#define H1OUTPS1                         BANKMASK(HLT1CON0), 4
#define H1OUTPS2                         BANKMASK(HLT1CON0), 5
#define H1OUTPS3                         BANKMASK(HLT1CON0), 6
#define H1REREN                          BANKMASK(HLT1CON1), 0
#define HLTMR1IE                         BANKMASK(PIE1), 2
#define HLTMR1IF                         BANKMASK(PIR1), 2
#define HTS                              BANKMASK(OSCCON), 2
#define INTE                             BANKMASK(INTCON), 4
#define INTEDG                           BANKMASK(OPTION_REG), 6
#define INTF                             BANKMASK(INTCON), 1
#define IOCAF0                           BANKMASK(IOCAF), 0
#define IOCAF1                           BANKMASK(IOCAF), 1
#define IOCAF2                           BANKMASK(IOCAF), 2
#define IOCAF3                           BANKMASK(IOCAF), 3
#define IOCAF4                           BANKMASK(IOCAF), 4
#define IOCAF5                           BANKMASK(IOCAF), 5
#define IOCAN0                           BANKMASK(IOCAN), 0
#define IOCAN1                           BANKMASK(IOCAN), 1
#define IOCAN2                           BANKMASK(IOCAN), 2
#define IOCAN3                           BANKMASK(IOCAN), 3
#define IOCAN4                           BANKMASK(IOCAN), 4
#define IOCAN5                           BANKMASK(IOCAN), 5
#define IOCAP0                           BANKMASK(IOCAP), 0
#define IOCAP1                           BANKMASK(IOCAP), 1
#define IOCAP2                           BANKMASK(IOCAP), 2
#define IOCAP3                           BANKMASK(IOCAP), 3
#define IOCAP4                           BANKMASK(IOCAP), 4
#define IOCAP5                           BANKMASK(IOCAP), 5
#define IOCIE                            BANKMASK(INTCON), 3
#define IOCIF                            BANKMASK(INTCON), 0
#define IRCF0                            BANKMASK(OSCCON), 4
#define IRCF1                            BANKMASK(OSCCON), 5
#define LATA0                            BANKMASK(LATA), 0
#define LATA1                            BANKMASK(LATA), 1
#define LATA2                            BANKMASK(LATA), 2
#define LATA4                            BANKMASK(LATA), 4
#define LATA5                            BANKMASK(LATA), 5
#define LTS                              BANKMASK(OSCCON), 1
#define MCOUT1                           BANKMASK(CMOUT), 0
#define MCOUT2                           BANKMASK(CMOUT), 1
#define PEIE                             BANKMASK(INTCON), 6
#define PS0                              BANKMASK(OPTION_REG), 0
#define PS1                              BANKMASK(OPTION_REG), 1
#define PS2                              BANKMASK(OPTION_REG), 2
#define PSA                              BANKMASK(OPTION_REG), 3
#define RA0                              BANKMASK(PORTA), 0
#define RA1                              BANKMASK(PORTA), 1
#define RA2                              BANKMASK(PORTA), 2
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA5                              BANKMASK(PORTA), 5
#define RD                               BANKMASK(PMCON1), 0
#define RP0                              BANKMASK(STATUS), 5
#define RP1                              BANKMASK(STATUS), 6
#define SLRA0                            BANKMASK(SLRCONA), 0
#define SLRA2                            BANKMASK(SLRCONA), 2
#define T0CS                             BANKMASK(OPTION_REG), 5
#define T0IE                             BANKMASK(INTCON), 5
#define T0IF                             BANKMASK(INTCON), 2
#define T0SE                             BANKMASK(OPTION_REG), 4
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1GGO                            BANKMASK(T1GCON), 3
#define T1GGO_nDONE                      BANKMASK(T1GCON), 3
#define T1GPOL                           BANKMASK(T1GCON), 6
#define T1GSEL                           BANKMASK(APFCON), 4
#define T1GSPM                           BANKMASK(T1GCON), 4
#define T1GSS0                           BANKMASK(T1GCON), 0
#define T1GSS1                           BANKMASK(T1GCON), 1
#define T1GTM                            BANKMASK(T1GCON), 5
#define T1GVAL                           BANKMASK(T1GCON), 2
#define T2CKPS0                          BANKMASK(T2CON), 0
#define T2CKPS1                          BANKMASK(T2CON), 1
#define T2OUTPS0                         BANKMASK(T2CON), 3
#define T2OUTPS1                         BANKMASK(T2CON), 4
#define T2OUTPS2                         BANKMASK(T2CON), 5
#define T2OUTPS3                         BANKMASK(T2CON), 6
#define TMR1CS0                          BANKMASK(T1CON), 6
#define TMR1CS1                          BANKMASK(T1CON), 7
#define TMR1GE                           BANKMASK(T1GCON), 7
#define TMR1GIE                          BANKMASK(PIE1), 7
#define TMR1GIF                          BANKMASK(PIR1), 7
#define TMR1IE                           BANKMASK(PIE1), 0
#define TMR1IF                           BANKMASK(PIR1), 0
#define TMR1ON                           BANKMASK(T1CON), 0
#define TMR2IE                           BANKMASK(PIE1), 1
#define TMR2IF                           BANKMASK(PIR1), 1
#define TMR2ON                           BANKMASK(T2CON), 2
#define TRISA0                           BANKMASK(TRISA), 0
#define TRISA1                           BANKMASK(TRISA), 1
#define TRISA2                           BANKMASK(TRISA), 2
#define TRISA3                           BANKMASK(TRISA), 3
#define TRISA4                           BANKMASK(TRISA), 4
#define TRISA5                           BANKMASK(TRISA), 5
#define TUN0                             BANKMASK(OSCTUNE), 0
#define TUN1                             BANKMASK(OSCTUNE), 1
#define TUN2                             BANKMASK(OSCTUNE), 2
#define TUN3                             BANKMASK(OSCTUNE), 3
#define TUN4                             BANKMASK(OSCTUNE), 4
#define VCFG                             BANKMASK(ADCON0), 6
#define WPUA0                            BANKMASK(WPUA), 0
#define WPUA1                            BANKMASK(WPUA), 1
#define WPUA2                            BANKMASK(WPUA), 2
#define WPUA3                            BANKMASK(WPUA), 3
#define WPUA4                            BANKMASK(WPUA), 4
#define WPUA5                            BANKMASK(WPUA), 5
#define WR                               BANKMASK(PMCON1), 1
#define WREN                             BANKMASK(PMCON1), 2
#define ZERO                             BANKMASK(STATUS), 2
#define nBOR                             BANKMASK(PCON), 0
#define nPD                              BANKMASK(STATUS), 3
#define nPOR                             BANKMASK(PCON), 1
#define nRAPU                            BANKMASK(OPTION_REG), 7
#define nT1SYNC                          BANKMASK(T1CON), 2
#define nTO                              BANKMASK(STATUS), 4

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

psect udata_shr,class=COMMON,space=SPACE_DATA,noexec
psect udata,class=RAM,space=SPACE_DATA,noexec
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,delta=2
psect data,class=STRCODE,space=SPACE_CODE,delta=2,noexec

#endif // _XC_INC_

#endif // _PIC12F752_INC_
